# ViewCameraOrientation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewCameraOrientation Property
ParameterTypeId Class See Also
---
"Locked Orientation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewCameraOrientation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewCameraOrientation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewCameraOrientation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace